### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws.aws_instance.ansible_server must be replaced
-/+ resource "aws_instance" "ansible_server" {
!       ami                                  = "ami-03bf1693dac38619d" -> "ami-077c35a120f803c17" # forces replacement
!       arn                                  = "arn:aws:ec2:ap-northeast-3:939989362915:instance/i-03fc716f17aec29e8" -> (known after apply)
!       associate_public_ip_address          = true -> (known after apply)
!       availability_zone                    = "ap-northeast-3c" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
!       disable_api_stop                     = false -> (known after apply)
!       disable_api_termination              = false -> (known after apply)
!       ebs_optimized                        = false -> (known after apply)
+       enable_primary_ipv6                  = (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
!       id                                   = "i-03fc716f17aec29e8" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
+       instance_lifecycle                   = (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       placement_partition_number           = 0 -> (known after apply)
!       primary_network_interface_id         = "eni-01a6fab4524d3929c" -> (known after apply)
!       private_dns                          = "ip-172-18-1-30.ap-northeast-3.compute.internal" -> (known after apply)
!       private_ip                           = "172.18.1.30" -> (known after apply)
+       public_dns                           = (known after apply)
!       public_ip                            = "56.155.125.8" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
-       source_dest_check                    = true -> null
+       spot_instance_request_id             = (known after apply)
!       subnet_id                            = "subnet-0e8a46a7052a7b3fa" -> (known after apply)
        tags                                 = {
            "Name" = "dvmn-asm-01"
        }
!       tenancy                              = "default" -> (known after apply)
+       user_data_base64                     = (known after apply)
!       vpc_security_group_ids               = [
-           "sg-0cfe1e8bae4be07e5",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

!       capacity_reservation_specification {
!           capacity_reservation_preference = "open" -> (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

!       cpu_options {
+           amd_sev_snp      = (known after apply)
!           core_count       = 1 -> (known after apply)
!           threads_per_core = 2 -> (known after apply)
        }

-       credit_specification {
-           cpu_credits = "unlimited" -> null
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           tags_all              = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

!       enclave_options {
!           enabled = false -> (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       instance_market_options {
+           market_type = (known after apply)

+           spot_options {
+               instance_interruption_behavior = (known after apply)
+               max_price                      = (known after apply)
+               spot_instance_type             = (known after apply)
+               valid_until                    = (known after apply)
            }
        }


!       metadata_options {
!           http_endpoint               = "enabled" -> (known after apply)
!           http_protocol_ipv6          = "disabled" -> (known after apply)
!           http_put_response_hop_limit = 2 -> (known after apply)
!           http_tokens                 = "required" -> (known after apply)
!           instance_metadata_tags      = "disabled" -> (known after apply)
        }


!       private_dns_name_options {
!           enable_resource_name_dns_a_record    = false -> (known after apply)
!           enable_resource_name_dns_aaaa_record = false -> (known after apply)
!           hostname_type                        = "ip-name" -> (known after apply)
        }

!       root_block_device {
!           device_name           = "/dev/sda1" -> (known after apply)
!           iops                  = 3000 -> (known after apply)
+           kms_key_id            = (known after apply)
-           tags                  = {} -> null
!           tags_all              = {} -> (known after apply)
!           volume_id             = "vol-04586a0837012cf1b" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # module.tailscale.tailscale_device_key.ansible_server_key will be updated in-place
!   resource "tailscale_device_key" "ansible_server_key" {
!       device_id           = "8272314915437078" -> "1029203818568380"
        id                  = "8272314915437078"
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>